app/controllers/books_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
    def set_book_params
      puts "set_book_paramsが動いている"
      @book = Book.find(params[:id])